from model.keyword_extractor import Prompt, KeywordResult

_prompt_01 = Prompt(text="""氣象署今天（16日）上午發布熱帶性低氣壓生成訊息，預估最快明天就會增強為今年第6號颱風「薇帕」。氣象署指出，18日起台灣受其外圍水氣影響，東半部及恆春半島嚴防局部大雨或豪雨；至於是否會發布颱風警報？仍要視其路徑及暴風半徑而定。""")

_prompt_02 = Prompt(text="""颱風丹娜絲日前侵台，經濟部統計造成嘉南地區共14.5萬片光電板損壞。環境部長彭啓明今天表示，檢測當地水質，量測10項對人體有害的重金屬物，皆符合標準，澄清網傳光電板導致當地魚產有毒為錯誤訊息，且業者目前均積極處理廢棄光電板，最快一個半月即可完成。""")


_keyword_result_01 = KeywordResult(keywords=['氣象署', '發布', '16', '熱帶性', '低氣壓', '訊息'])

_keyword_result_02 = KeywordResult(keywords=[
        "光電板",
        "當地",
        "風丹娜",
        "侵台",
        "經濟部",
        "統計"
    ])